[
    {
        "category": "Benefits",
        "text": "Monthly payouts for life: CPF LIFE provides a regular monthly income that lasts as long as you live. Reliability: It is more reliable than private annuity plans. Guaranteed by the Singapore Government: The payouts are guaranteed, offering peace of mind. Flexible start age: You can start CPF LIFE payouts anytime from age 65 to 70.",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Plans",
        "text": "CPF Board In a nutshell: An annuity scheme is a contract where the insurer makes steady payments to you in the future CPF LIFE has 3 plans: the Escalating Plan, the Standard Plan and the Basic Plan Your CPF LIFE monthly payouts will first be paid from your CPF LIFE premiums false Ensuring you have steady payouts for life is important not only for your retirement years, but also helps give you peace of mind in the present. CPF LIFE is one such annuity scheme that provides you with just that – read on to be more informed about the mechanics behind this! What is an annuity scheme? An annuity scheme is a contract between you and an insurance company, where the insurer is",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Plans",
        "text": "scheme? An annuity scheme is a contract between you and an insurance company, where the insurer is required to make steady payments to you in the future over a period of time. Annuities can be paid out to you in a lump sum or over a period of time, but in the case of CPF LIFE, it is the latter. Which brings us to the next question: What is CPF LIFE? CPF Lifelong Income For the Elderly (CPF LIFE) is a national longevity insurance annuity scheme that provides you with monthly payouts no matter how long you live. It can do so with three different plans, each offering varying levels of payouts to suit your needs. These plans are: Escalating Plan The Escalating Plan offers monthly payouts that start lower initially but grow by 2% a year for life, which can help deal with inflation while not having to adjust your spending habits too much. Standard Plan The Standard Plan offers steady monthly payouts, but as they do not increase over time, it does not protect you from inflation, which means",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Plans",
        "text": "payouts, but as they do not increase over time, it does not protect you from inflation, which means you should be prepared to adjust your spending over time. Basic Plan Payouts under the Basic Plan fall when your CPF balances fall below $60,000. If you are able to lower your spending over time, then this payout works best for you. What are CPF LIFE premiums? Similar to paying a premium for an insurance policy, the CPF LIFE premium is the amount you pay for the CPF LIFE policy in exchange for regular monthly payouts for as long as you live. The amount of CPF LIFE premium varies depending on the CPF LIFE plan you choose. If you join the CPF LIFE Escalating or Standard Plan, the savings in your Retirement Account (RA) will be deducted as the annuity premium when you start your payouts. You will then receive the monthly payouts from your payout start age for as long as you live. Your monthly payouts will first be paid from your CPF LIFE premiums. When your CPF LIFE premium is depleted,",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Plans",
        "text": "payouts will first be paid from your CPF LIFE premiums. When your CPF LIFE premium is depleted, you will continue to receive the monthly payouts from the pooled interest that has been accumulated, no matter how long you live. If you join the CPF LIFE Basic Plan, about 10 to 20% of your savings in your RA will be deducted as the annuity premium when you start your payouts. Subsequently, you will receive monthly payouts from the remaining 80% to 90% of your savings in the RA from your chosen payout start age until one month before you reach 90 years old. After reaching 90 years old, you will receive the monthly payout from your CPF LIFE premiums. As less is used for your CPF LIFE premium, the monthly payout will be lower compared to the Standard Plan. Similar to Escalating and Standard Plan, once the CPF LIFE premium is depleted, you will continue to receive monthly payouts from the accumulated pooled interest, regardless of your lifespan. What CPF LIFE can do for you CPF LIFE is an",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Benefits",
        "text": "pooled interest, regardless of your lifespan. What CPF LIFE can do for you CPF LIFE is an annuity designed to provide lifelong monthly income for your retirement needs, offering peace of mind during retirement. This can help to defray recurring costs like healthcare insurance premiums, as well as utility and grocery bills, and support you in leading the lifestyle you envision. If you wish to learn more, the CPF LIFE page has some helpful information to assist you in understanding what CPF LIFE is about. Planning your payouts in retirement Now that you know how CPF LIFE works, the first step is to think about the kind of retirement lifestyle you would like to lead, and how much you’d need to sustain this. Try out the CPF planner – retirement income which can help you visualise how much income you need in retirement, project your future CPF payouts, and explore options to close any gaps in your path towards your goals. The information provided in this article is accurate as of the date",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Others",
        "text": "your path towards your goals. The information provided in this article is accurate as of the date of publication. You might also be interested in... Retiring well Closure of Special Account for members aged 55 and above in Jan 2025 Here’s what you need to know about the closure of the Special Account and how you can maximise your CPF savings. 19 Jul 2024 • 10 minute read Retiring well How to use CPF LIFE as the cornerstone of your retirement planning Having a reliable source of income in retirement can help you live out your golden years comfortably. Here’s Christopher Tan’s take on retirement planning. 05 Jul 2024 • 8 minute read CPF overview New CPF contribution rates for senior workers Here are the changes to the CPF contribution rate in 2025. 21 Mar 2024 • 3 minute read Retiring well Closure of Special Account for members aged 55 and above in Jan 2025 Here’s what you need to know about the closure of the Special Account and how you can maximise your CPF savings. 19 Jul 2024 • 10",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Others",
        "text": "the closure of the Special Account and how you can maximise your CPF savings. 19 Jul 2024 • 10 minute read Retiring well How to use CPF LIFE as the cornerstone of your retirement planning Having a reliable source of income in retirement can help you live out your golden years comfortably. Here’s Christopher Tan’s take on retirement planning. 05 Jul 2024 • 8 minute read CPF overview New CPF contribution rates for senior workers Here are the changes to the CPF contribution rate in 2025. 21 Mar 2024 • 3 minute read View all Help us improve CPF Board Business partners Useful links Careers Contact us Feedback FAQ Report vulnerability Privacy statement Terms of use Sitemap Security best practices © 2024, Government of Singapore Last updated 30 Sep 2024",
        "source": "CPFB _ CPF LIFE premiums_ how does it work_.html"
    },
    {
        "category": "Benefits",
        "text": "CPFB | How to use CPF LIFE as the cornerstone of your retirement planning A Singapore Government Agency Website How to use CPF LIFE as the cornerstone of your retirement planning Login Last login on {loginDate} Account settings Log out Who we are Tools and services Infohub Choose Member Member Member Employer/ Business Member Employer/Business Login Last login on {loginDate} Account settings Log out Search Search You are at Member Employer/Business my cpf Account balances, dashboards, statements, and more. CPF overview Growing your savings Retirement income Home ownership Healthcare financing Account services Who we are Tools and services Infohub PLAN with CPF FAQs Calculators Forms Main menu my cpf my cpf Home My dashboards My statements Activities Mailbox my cpf My dashboards Retirement Home ownership Healthcare Providing for your loved ones Self-employment Investment Education Child my cpf My statements Transaction history Year-in-Review Yearly Statement of Account Main menu CPF",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "my cpf My statements Transaction history Year-in-Review Yearly Statement of Account Main menu CPF overview Find out more Main menu Growing your savings Find out more CPF contributions More ways to save Investments and interest Government support Growing your savings CPF contributions Self-employed persons Employees Platform workers Growing your savings More ways to save Retirement top-ups and transfers Matching grant for seniors Voluntary housing refunds MediSave top-ups Growing your savings Investments and interest Investing your CPF CPF interest rates Growing your savings Government support Workfare Income Supplement Platform Workers CPF Transition Support Main menu Retirement income Find out more Milestones Monthly payouts Retirement withdrawals Government support Retirement income Milestones Reaching age 55 Reaching age 65 Retirement income Monthly payouts CPF LIFE Other payouts Retirement income Retirement withdrawals For immediate needs For reduced life expectancy Retirement",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "Retirement income Retirement withdrawals For immediate needs For reduced life expectancy Retirement income Government support Silver Support Scheme Main menu Home ownership Find out more Using CPF for housing Protecting against losing your home Planning your housing journey Main menu Healthcare financing Find out more Using MediSave MediShield Life Supplementary coverage ElderShield CareShield Life Main menu Account services Find out more Your account information Providing for your loved ones Account closure Undergoing a divorce Account services Your account information View account balances Update account settings Account services Providing for your loved ones CPF nomination Insuring to protect your dependants Account services Account closure When you pass away When you leave Singapore Account services Undergoing a divorce Division of CPF assets my cpf CPF overview Growing your savings Retirement income Home ownership Healthcare financing Account services my cpf my cpf Home My",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "Retirement income Home ownership Healthcare financing Account services my cpf my cpf Home My dashboards My statements Retirement Home ownership Healthcare Providing for your loved ones Self-employment Investment Education Child Transaction history Year-in-Review Yearly Statement of Account Activities Mailbox Growing your savings Find out more CPF contributions More ways to save Investments and interest Government support Self-employed persons Employees Platform workers Retirement top-ups and transfers Matching grant for seniors Voluntary housing refunds MediSave top-ups Investing your CPF CPF interest rates Workfare Income Supplement Platform Workers CPF Transition Support PLAN with CPF FAQs Calculators Forms Retirement income Find out more Milestones Monthly payouts Retirement withdrawals Government support Reaching age 55 Reaching age 65 CPF LIFE Other payouts For immediate needs For reduced life expectancy Silver Support Scheme PLAN with CPF FAQs Calculators Forms Home ownership",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Others",
        "text": "reduced life expectancy Silver Support Scheme PLAN with CPF FAQs Calculators Forms Home ownership Find out more Using CPF for housing Protecting against losing your home Planning your housing journey PLAN with CPF FAQs Calculators Forms Healthcare financing Find out more Using MediSave MediShield Life Supplementary coverage ElderShield CareShield Life PLAN with CPF FAQs Calculators Forms Account services Find out more Your account information Providing for your loved ones Account closure Undergoing a divorce View account balances Update account settings CPF nomination Insuring to protect your dependants When you pass away When you leave Singapore Division of CPF assets PLAN with CPF FAQs Calculators Forms Your session is about to time out. You have been inactive for a while. Would you like to log out or continue? Log out Continue View page in mobile app We recommend viewing this page in the CPF Mobile app. Download the app? Download Continue with browser Home Infohub Educational",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Others",
        "text": "in the CPF Mobile app. Download the app? Download Continue with browser Home Infohub Educational resources How to use CPF LIFE as the cornerstone of your retirement planning Educational resources How to use CPF LIFE as the cornerstone of your retirement planning Having a reliable source of income in retirement can help you live out your golden years comfortably. Here’s Christopher Tan’s take on retirement planning. Facebook Facebook Telegram WhatsApp Email LinkedIn Twitter Facebook Telegram WhatsApp Email LinkedIn Twitter 5 Jul 2024 SOURCE: Christopher Tan (Providend) Whenever we talk about retirement planning, the focus has almost always been on accumulating towards retirement. Very little has been spoken about withdrawing during retirement. But planning for retirees on how they can spend in this phase of their lives is extremely important and arguably more complex than accumulation. This is because some of the risks faced in retirement are unique to retirees and, if they occur, can",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Others",
        "text": "is because some of the risks faced in retirement are unique to retirees and, if they occur, can disrupt their lifestyle. These risks are: Longevity risk – the chance of outliving one’s retirement savings. Inflation risk – the prospect of reduced purchasing power over time. Healthcare risk – the risk of not being able to pay for medical expenses. Investment risk – the possibility of market volatility affecting one’s investments and income. Spending risk – the risk of overspending or underspending during their retirement years. In order to mitigate the above risks and ensure that you have a reliable source of income in retirement, the following steps should be considered: Craft a good spending plan by first listing down all your assets which can give you an income. Based on the retirement lifestyle you wish to have, carefully estimate your expenses at different stages in retirement. From these estimated expenses, decide what amount is absolutely necessary (essential) with the remaining",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Others",
        "text": "these estimated expenses, decide what amount is absolutely necessary (essential) with the remaining amount being good to have (discretionary) . The next step, which is the most complex, is to match suitable assets/instruments with the types of expenses needed at various stages in retirement. Matching suitable assets/instruments with your expenses Discretionary For discretionary spending, you can use asset classes that are riskier but with higher expected returns, such as equities. But at appropriate times throughout your retiring years, you need to gradually convert portions of these investments to liquid cash or cash-like instruments for discretionary expenses that are needed in the immediate five years of your retirement. When investing, consider your appetite for risk and take the time to learn more about how your investment work. Cash savings, fixed deposits, T-bills, Singapore Government Securities, Singapore Savings Bonds (SSBs), and short-term single premium endowments are",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "Government Securities, Singapore Savings Bonds (SSBs), and short-term single premium endowments are suitable instruments to convert into. Essential To fund essential expenses throughout retirement, assets that are safe and stable regardless of financial market volatility as well as able to mitigate longevity risk should be used. CPF LIFE, private annuities, retirement income insurance plans, and investment grade bonds are examples of such assets. But for bonds, one needs to have large amount of capital to meaningfully use them to generate sufficient income. And since not everyone is able to access to or have the knowledge to know how to invest in them, it may be more practical for most to use CPF LIFE, and insurance-based financial instruments to fund essential expenses. This article will focus on how you can fund your essential expenses and mitigate the five risks using CPF LIFE. It is my opinion that every retiree should have annuities in their portfolio. This is because, there are",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Others",
        "text": "my opinion that every retiree should have annuities in their portfolio. This is because, there are not many instruments that can mitigate inflation, investment, over or under spending and most importantly, longevity risk. This makes annuities ideal for funding essential expenses. It is also my opinion that CPF LIFE is the best annuity in Singapore. But before I show why I feel this way, let us first understand how CPF LIFE works. How CPF LIFE works In your working years, your employer and you contribute to your respective CPF accounts and the government gives you risk-free interest to help you grow your CPF savings. When you reach 55 years old, your accumulated CPF savings, first from your SA followed by your OA up to the Full Retirement Sum (FRS) will be transferred to your newly created Retirement Account (RA). This amount of money will continue to earn interest and as early as age 65, you can decide which CPF LIFE plans to choose from depending on your needs. Table 1 below shows",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Plans",
        "text": "65, you can decide which CPF LIFE plans to choose from depending on your needs. Table 1 below shows some differences between the Basic, Standard and Escalating Plans. Table 1: Estimated payouts using CPF LIFE Estimator based on a 55-year-old male in 2024 with a Full Retirement Sum of $205,800 There are 3 things to note about CPF LIFE: 1) The Split Between Amounts in RA and Annuity Pool At age 65, if you choose the Basic Plan, CPFB will transfer about 10%-20% of the savings in your RA to the annuity pool. This amount is known as the “Annuity Premium” which currently earns 4%* p.a. interest. The remaining savings in your RA will be streamed out immediately until you are 90 years old. After which, the monthly payouts will come from the annuity pool. If we decide to choose the Standard or Escalating Plan instead, 100% of the savings in your RA will be moved to the annuity pool and you will receive monthly payouts from the annuity pool. CPF LIFE functions on risk pooling, where the",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Plans",
        "text": "will receive monthly payouts from the annuity pool. CPF LIFE functions on risk pooling, where the interest accumulated from the CPF LIFE premiums of all CPF LIFE members is pooled. In addition, there is a capital protection feature which means that any unused premiums will be refunded to the deceased member’s beneficiaries. * Based on the interest rate floor of 4% per annum 2) CPF LIFE Payouts When you are receiving your payouts from the annuity pool, regardless of the CPF LIFE plan that you are in, the interest earned on your annuity premium is shared amongst all CPF members to form part of your monthly payouts. The other part of your monthly payouts comes from your annuity premium. From Table 1 above, you can see that the payout from Standard Plan is higher than the Basic Plan. This is because your annuity premium is higher for the Standard Plan. You will also notice that as you get older, the payouts from the Basic Plan decreases. This is because as most of your earlier payouts",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Plans",
        "text": "older, the payouts from the Basic Plan decreases. This is because as most of your earlier payouts were coming from your RA, your RA + LIFE balances will fall below $60,000 and because you will be earning lesser extra interest on the first $60,000, the payouts amount falls. As for the Escalating Plan, the initial payout is about 20% lower than the Standard Plan but increases by about 2% p.a. This is one of the ways CPF LIFE can mitigate inflation risk. As such, the Escalating Plan is suitable for members who can accept a lower initial payout but would like to hedge against rising cost of living. Another way CPFB mitigates inflation risk is by adjusting the Retirement Sums each year according to life expectancy, standard of living and long-term inflation. As the retirement sum increases, CPF LIFE payouts also increase. The final point to note here is that while you can start receiving payouts as early as age 65 (the latest being age 70), if you choose to delay receiving them, for every",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Plans",
        "text": "as early as age 65 (the latest being age 70), if you choose to delay receiving them, for every year that you delay, your payout amount increases by about 7%. 3) What happens to unused CPF savings in your RA and annuity pool upon death? Except for your unused interest earned on your annuity premium, other unused CPF savings are returned to your beneficiaries. For the unused interest, it remains in the annuity pool and is used to ensure that remaining CPF LIFE members can continue to get monthly payouts for as long as they live. Even if you live beyond your own expected life expectancy and your premiums are exhausted, your payouts are still guaranteed for life. This is thanks to other members’ interests being pooled. This is how CPF LIFE can mitigate longevity risk for CPF members . So, in a sense, CPF LIFE is a collective effort that includes both member and government support. For the Standard and Escalating Plans, since 100% of your RA is transferred to the annuity pool, the absolute",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Plans",
        "text": "and Escalating Plans, since 100% of your RA is transferred to the annuity pool, the absolute amount of the interest earned on the annuity premium will be more than that of the Basic Plan. This also means that upon demise, the absolute amount of unused interest earned on the annuity premium will be larger than that of the Basic Plan. Some may question whether they will “lose out” in this case? Well, if you live a long life, you may actually be the one who will stand to gain. The truth is no one knows how long they will live. But I will also share more about why bequest should not be the factor to consider for your choice of CPF LIFE plan later in the article. Are there other better options to CPF LIFE? From 2025, the top-up limit for RA, also known as the Enhanced Retirement Sum (ERS) will increase from three times of the Basic Retirement Sum (BRS) to four times. So, should you top-up your RA up to the new ERS or should you buy private annuities or insurance-based Retirement Income",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Plans",
        "text": "your RA up to the new ERS or should you buy private annuities or insurance-based Retirement Income Plans instead? Is CPF LIFE really the best annuity in Singapore? To help you make this decision, I compared CPF LIFE with three popular retirement income insurance plans in the market (see Table 2). Given that all insurers have to use the same projection rates on their benefit illustrations, the results wouldn’t deviate too much except for the different frills offered by different product providers. For comparison, I used the CPF LIFE Standard Plan and the Full Retirement Sum (FRS) for 2025. For the private retirement income insurance plans, I used the higher returns assumption of 4.25% p.a. Even with this higher returns assumption, you can see quite clearly that CPF LIFE is superior. Although the private insurance plan’s bequest amount is higher, the monthly payout is lower. Having said this, CPF LIFE’s effective interest is still higher than the private insurance plans in almost all",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "this, CPF LIFE’s effective interest is still higher than the private insurance plans in almost all occasions after considering payouts and bequests. But an annuity is an insurance plan and not an investment plan. It would be foolish to buy an annuity plan based on its bequest amount or effective returns! Your decision should be based on how much payout you need to fund your expenses in your lifetime. Even when we compare the annual payout per dollar premium, CPF LIFE trounced all the other private Retirement Income Plans. The one advantage of private insurance plans over CPF LIFE is that you can surrender the policy if you need to and get some money back (typically with a penalty incurred) whereas you cannot do the same with CPF LIFE. But all things considered, CPF LIFE is without doubt the best annuity in Singapore. So, if you are financially able to, my suggestion is to first top-up your RA up to the amount (subject to ERS limit) that will give you the CPF LIFE monthly payout you",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "your RA up to the amount (subject to ERS limit) that will give you the CPF LIFE monthly payout you need to fund the essential expenses in your spending plan. If the maximum monthly payout from CPF LIFE is still insufficient, you can use other suitable instruments such as private Retirement Income Insurance Plans to supplement it. If you do not want all your cash to be locked up in your CPF, just set aside your cohort’s FRS to “buy” CPF LIFE and supplement the rest of your essential expenses with other instruments such as retirement income insurance plans. Although you have to accept a possibly lower monthly payout or pay a higher premium to get the payout you need, you do get some flexibility to cash out and enjoy some liquid cash by surrendering your insurance policy. Alternatively, you can buy private annuities offering equivalent benefits to CPF LIFE and apply to be exempted from setting aside the retirement sum and withdraw all your CPF retirement savings. However, as demonstrated",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "aside the retirement sum and withdraw all your CPF retirement savings. However, as demonstrated through the comparison at Table 2, it is quite difficult to find policies that are better than CPF LIFE these days. Table 2: Comparison between CPF LIFE and Retirement Income Plans * A credit rating shows how reliable an institution is at repaying borrowed money. AAA is better than A+ because it indicates the highest level of trustworthiness and financial stability. The five risks that retirees face during retirement are very real. With CPF LIFE being Singapore’s best annuity plan backed by the Singapore government and with your cash savings in MediSave Account (MA) as the cornerstone of your retirement plan, you can mitigate longevity, inflation, healthcare, investment, and spending risk. This will give you a reliable income stream in your golden years to enable your life goals and have a peace of mind. Christopher Tan is CEO, Providend Ltd, Southeast Asia's first fee-only comprehensive",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "peace of mind. Christopher Tan is CEO, Providend Ltd, Southeast Asia's first fee-only comprehensive wealth advisory firm. He can be contacted at chris_tan@providend.com The information provided in this article is accurate as of the date of publication. You might also be interested in... CPF overview How to stay safe from scams Don’t fall prey to scammers. Brush up on your knowledge of scams! 20 Jun 2024 • 5 minute read Growing savings Matched Retirement Savings Scheme (MRSS) – what you need to know The MRSS enhancements allow more members to save more for their retirement. Here’s all you need to know. 24 May 2024 • 5 minute read Retiring well Key facts of CPF LIFE you should know CPF LIFE ensures regular payouts no matter how long you live. Find out how! 18 Apr 2024 • 5 minute read CPF overview How to stay safe from scams Don’t fall prey to scammers. Brush up on your knowledge of scams! 20 Jun 2024 • 5 minute read Growing savings Matched Retirement Savings Scheme (MRSS) – what you",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "20 Jun 2024 • 5 minute read Growing savings Matched Retirement Savings Scheme (MRSS) – what you need to know The MRSS enhancements allow more members to save more for their retirement. Here’s all you need to know. 24 May 2024 • 5 minute read Retiring well Key facts of CPF LIFE you should know CPF LIFE ensures regular payouts no matter how long you live. Find out how! 18 Apr 2024 • 5 minute read View all Help us improve CPF Board Business partners Useful links Careers Contact us Feedback FAQ Report vulnerability Privacy statement Terms of use Sitemap Security best practices © 2024, Government of Singapore Last updated 05 Jul 2024",
        "source": "CPFB _ How to use CPF LIFE as the cornerstone of your retirement planning.html"
    },
    {
        "category": "Benefits",
        "text": "CPFB | Key facts of CPF LIFE you should know A Singapore Government Agency Website Key facts of CPF LIFE you should know Login Last login on {loginDate} Account settings Log out Who we are Tools and services Infohub Choose Member Member Member Employer/ Business Member Employer/Business Login Last login on {loginDate} Account settings Log out Search Search You are at Member Employer/Business my cpf Account balances, dashboards, statements, and more. CPF overview Growing your savings Retirement income Home ownership Healthcare financing Account services Who we are Tools and services Infohub PLAN with CPF FAQs Calculators Forms Main menu my cpf my cpf Home My dashboards My statements Activities Mailbox my cpf My dashboards Retirement Home ownership Healthcare Providing for your loved ones Self-employment Investment Education Child my cpf My statements Transaction history Year-in-Review Yearly Statement of Account Main menu CPF overview Find out more Main menu Growing your savings Find",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "Statement of Account Main menu CPF overview Find out more Main menu Growing your savings Find out more CPF contributions More ways to save Investments and interest Government support Growing your savings CPF contributions Self-employed persons Employees Platform workers Growing your savings More ways to save Retirement top-ups and transfers Matching grant for seniors Voluntary housing refunds MediSave top-ups Growing your savings Investments and interest Investing your CPF CPF interest rates Growing your savings Government support Workfare Income Supplement Platform Workers CPF Transition Support Main menu Retirement income Find out more Milestones Monthly payouts Retirement withdrawals Government support Retirement income Milestones Reaching age 55 Reaching age 65 Retirement income Monthly payouts CPF LIFE Other payouts Retirement income Retirement withdrawals For immediate needs For reduced life expectancy Retirement income Government support Silver Support Scheme Main menu Home",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "reduced life expectancy Retirement income Government support Silver Support Scheme Main menu Home ownership Find out more Using CPF for housing Protecting against losing your home Planning your housing journey Main menu Healthcare financing Find out more Using MediSave MediShield Life Supplementary coverage ElderShield CareShield Life Main menu Account services Find out more Your account information Providing for your loved ones Account closure Undergoing a divorce Account services Your account information View account balances Update account settings Account services Providing for your loved ones CPF nomination Insuring to protect your dependants Account services Account closure When you pass away When you leave Singapore Account services Undergoing a divorce Division of CPF assets my cpf CPF overview Growing your savings Retirement income Home ownership Healthcare financing Account services my cpf my cpf Home My dashboards My statements Retirement Home ownership Healthcare Providing",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "my cpf my cpf Home My dashboards My statements Retirement Home ownership Healthcare Providing for your loved ones Self-employment Investment Education Child Transaction history Year-in-Review Yearly Statement of Account Activities Mailbox Growing your savings Find out more CPF contributions More ways to save Investments and interest Government support Self-employed persons Employees Platform workers Retirement top-ups and transfers Matching grant for seniors Voluntary housing refunds MediSave top-ups Investing your CPF CPF interest rates Workfare Income Supplement Platform Workers CPF Transition Support PLAN with CPF FAQs Calculators Forms Retirement income Find out more Milestones Monthly payouts Retirement withdrawals Government support Reaching age 55 Reaching age 65 CPF LIFE Other payouts For immediate needs For reduced life expectancy Silver Support Scheme PLAN with CPF FAQs Calculators Forms Home ownership Find out more Using CPF for housing Protecting against losing your home",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Others",
        "text": "Forms Home ownership Find out more Using CPF for housing Protecting against losing your home Planning your housing journey PLAN with CPF FAQs Calculators Forms Healthcare financing Find out more Using MediSave MediShield Life Supplementary coverage ElderShield CareShield Life PLAN with CPF FAQs Calculators Forms Account services Find out more Your account information Providing for your loved ones Account closure Undergoing a divorce View account balances Update account settings CPF nomination Insuring to protect your dependants When you pass away When you leave Singapore Division of CPF assets PLAN with CPF FAQs Calculators Forms Your session is about to time out. You have been inactive for a while. Would you like to log out or continue? Log out Continue View page in mobile app We recommend viewing this page in the CPF Mobile app. Download the app? Download Continue with browser Home Infohub Educational resources Key facts of CPF LIFE you should know Educational resources Key facts of",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "Educational resources Key facts of CPF LIFE you should know Educational resources Key facts of CPF LIFE you should know CPF LIFE ensures regular payouts no matter how long you live. Find out how! Facebook Facebook Telegram WhatsApp Email LinkedIn Twitter Facebook Telegram WhatsApp Email LinkedIn Twitter 18 Apr 2024 SOURCE: CPF Board In a nutshell: - CPF LIFE is a national longevity insurance annuity scheme that provides monthly payouts no matter how long you live - Under CPF LIFE, there are three plans to choose from: Escalating, Standard and Basic - CPF LIFE provides high risk-free payouts; interest earned on CPF LIFE premium is factored into the payouts false Retirement is when you look forward to enjoying your hobbies and free time when you are working less or no longer working. The last thing you want is to spend it worrying about your monthly income or running out of savings. This is where life annuities come in. A life annuity is a longevity insurance product where you pay a",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Plans",
        "text": "is where life annuities come in. A life annuity is a longevity insurance product where you pay a premium and the insurer provides regular payments to you as long as you live. CPF Lifelong Income For the Elderly (CPF LIFE) is a national longevity insurance annuity scheme that provides you with regular monthly payouts no matter how long you live, so you can enjoy your desired retirement lifestyle without worry. Here are some useful tidbits to help you better understand CPF LIFE. What makes up CPF LIFE? CPF LIFE consists of three plans you can choose from based on your desired retirement lifestyle: 1) Escalating Plan The Escalating Plan has monthly payouts that start lower initially, but grow by 2% a year for life. This generally helps you maintain your desired retirement lifestyle even as the prices of items increase over the years. 2) Standard Plan The Standard Plan offers steady monthly payouts over the years. If keeping a fixed budget is your preferred approach, the Standard Plan",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Plans",
        "text": "payouts over the years. If keeping a fixed budget is your preferred approach, the Standard Plan suits your needs. However, this plan does not protect you against inflation, so you will have to buy less as things get more expensive in the years ahead. 3) Basic Plan The Basic Plan offers monthly payouts that start low and fall progressively when your CPF balances fall below $60,000. This means you will have to lower your lifestyle and buy even lesser in the future. What are the benefits of CPF LIFE? CPF LIFE gives you peace of mind knowing that your retirement income will last no matter how long you live. You can start your CPF LIFE payouts anytime from age 65 to 70 years old, allowing your savings more time to accumulate more interest for when you finally need them. This ensures that you will have constant access to some form of income for your daily needs and passions even after you stop working, giving you peace of mind in retirement. CPF LIFE savings are also guaranteed by the",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "stop working, giving you peace of mind in retirement. CPF LIFE savings are also guaranteed by the Singapore Government, whereas private annuities are subject to investment market returns. In addition, as CPF LIFE is non-profit and administered by the CPF Board, it does not incur additional costs from advertising and agents’ commissions. Finally, having a large member base also means longevity risks and costs can be better spread out. All these factors allow CPF LIFE to provide more value on your monthly payouts and you can be more assured of a peaceful retirement. Why does CPF LIFE matter? A common question that is raised when talking about CPF LIFE is: Why should you care about monthly payouts? It comes down to risk management and knowing your own spending habits. As mentioned previously, CPF LIFE savings are guaranteed by the Singapore Government, which means its interest rates, with a floor of 4% and up to 2% extra interest per annum, come with no risk. For comparison, making a",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "a floor of 4% and up to 2% extra interest per annum, come with no risk. For comparison, making a lump sum withdrawal and letting it sit there instead of growing it with compound interest means you end up with less savings in the long run. Similarly, making large amount of withdrawals only to spend it all without planning ahead will also hurt your retirement lifestyle in the long run. Similarly, using your savings for investments brings with it inherent risks, while CPF LIFE is a more reliable option that ensures your savings are not only safe, but can also grow at a steady pace. Interests earned on your CPF LIFE savings are factored into your payouts, enabling you to receive higher payouts right from the start. CPF Board does not keep any of the interest earned. Instead, it is pooled and used to form the monthly payouts of the remaining CPF LIFE members. Like other annuities, this risk-pooling feature ensures that all CPF LIFE members are assured of monthly payouts for as long as they",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "feature ensures that all CPF LIFE members are assured of monthly payouts for as long as they live. This does not mean that your interest earned will be used to pay for other members’ payouts while you are alive! Like all annuity schemes, only the unpaid interest upon a member’s passing will go to the surviving members, with any unused premiums refunded to the deceased member’s beneficiaries. To help better illustrate the benefits of CPF LIFE, here’s a video on why it can benefit you more: Worrying about your savings even after retiring should not be a concern, as retirement should be reserved for you to enjoy life to its fullest. What CPF LIFE offers is the peace of mind to allow you to chase your passions and enjoy your desired retirement lifestyle. Contrary to popular belief, CPF LIFE is not an investment product, but rather an insurance product that provides members with peace of mind in their retirement years, while being a safer and more reliable option than private annuity",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Others",
        "text": "mind in their retirement years, while being a safer and more reliable option than private annuity products. To find out more, you can check out the CPF LIFE page . The information provided in this article is accurate as of the date of publication. You might also be interested in... CPF overview New CPF contribution rates for senior workers Here are the changes to the CPF contribution rate in 2025. 21 Mar 2024 • 3 minute read CPF overview CPF answers: why can’t I withdraw all my CPF savings at age 55? Learn more about CPF withdrawal rules at age 55. 04 Mar 2024 • 10 minute read CPF overview What is the CPF retirement sum? Confused about the CPF retirement sum? Learn more about these essential CPF terms for your retirement! 21 Feb 2024 • 5 minute read CPF overview New CPF contribution rates for senior workers Here are the changes to the CPF contribution rate in 2025. 21 Mar 2024 • 3 minute read CPF overview CPF answers: why can’t I withdraw all my CPF savings at age 55? Learn more about",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Others",
        "text": "read CPF overview CPF answers: why can’t I withdraw all my CPF savings at age 55? Learn more about CPF withdrawal rules at age 55. 04 Mar 2024 • 10 minute read CPF overview What is the CPF retirement sum? Confused about the CPF retirement sum? Learn more about these essential CPF terms for your retirement! 21 Feb 2024 • 5 minute read View all Help us improve CPF Board Business partners Useful links Careers Contact us Feedback FAQ Report vulnerability Privacy statement Terms of use Sitemap Security best practices © 2024, Government of Singapore Last updated 27 Jun 2024",
        "source": "CPFB _ Key facts of CPF LIFE you should know.html"
    },
    {
        "category": "Benefits",
        "text": "CPFB | What are the benefits of CPF LIFE? A Singapore Government Agency Website What are the benefits of CPF LIFE? Login Last login on {loginDate} Account settings Log out Who we are Tools and services Infohub Choose Member Member Member Employer/ Business Member Employer/Business Login Last login on {loginDate} Account settings Log out Search Search You are at Member Employer/Business my cpf Account balances, dashboards, statements, and more. CPF overview Growing your savings Retirement income Home ownership Healthcare financing Account services Who we are Tools and services Infohub PLAN with CPF FAQs Calculators Forms Main menu my cpf my cpf Home My dashboards My statements Activities Mailbox my cpf My dashboards Retirement Home ownership Healthcare Providing for your loved ones Self-employment Investment Education Child my cpf My statements Transaction history Year-in-Review Yearly Statement of Account Main menu CPF overview Find out more Main menu Growing your savings Find out more",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Benefits",
        "text": "of Account Main menu CPF overview Find out more Main menu Growing your savings Find out more CPF contributions More ways to save Investments and interest Government support Growing your savings CPF contributions Self-employed persons Employees Platform workers Growing your savings More ways to save Retirement top-ups and transfers Matching grant for seniors Voluntary housing refunds MediSave top-ups Growing your savings Investments and interest Investing your CPF CPF interest rates Growing your savings Government support Workfare Income Supplement Platform Workers CPF Transition Support Main menu Retirement income Find out more Milestones Monthly payouts Retirement withdrawals Government support Retirement income Milestones Reaching age 55 Reaching age 65 Retirement income Monthly payouts CPF LIFE Other payouts Retirement income Retirement withdrawals For immediate needs For reduced life expectancy Retirement income Government support Silver Support Scheme Main menu Home ownership",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Benefits",
        "text": "life expectancy Retirement income Government support Silver Support Scheme Main menu Home ownership Find out more Using CPF for housing Protecting against losing your home Planning your housing journey Main menu Healthcare financing Find out more Using MediSave MediShield Life Supplementary coverage ElderShield CareShield Life Main menu Account services Find out more Your account information Providing for your loved ones Account closure Undergoing a divorce Account services Your account information View account balances Update account settings Account services Providing for your loved ones CPF nomination Insuring to protect your dependants Account services Account closure When you pass away When you leave Singapore Account services Undergoing a divorce Division of CPF assets my cpf CPF overview Growing your savings Retirement income Home ownership Healthcare financing Account services my cpf my cpf Home My dashboards My statements Retirement Home ownership Healthcare Providing for",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Benefits",
        "text": "my cpf my cpf Home My dashboards My statements Retirement Home ownership Healthcare Providing for your loved ones Self-employment Investment Education Child Transaction history Year-in-Review Yearly Statement of Account Activities Mailbox Growing your savings Find out more CPF contributions More ways to save Investments and interest Government support Self-employed persons Employees Platform workers Retirement top-ups and transfers Matching grant for seniors Voluntary housing refunds MediSave top-ups Investing your CPF CPF interest rates Workfare Income Supplement Platform Workers CPF Transition Support PLAN with CPF FAQs Calculators Forms Retirement income Find out more Milestones Monthly payouts Retirement withdrawals Government support Reaching age 55 Reaching age 65 CPF LIFE Other payouts For immediate needs For reduced life expectancy Silver Support Scheme PLAN with CPF FAQs Calculators Forms Home ownership Find out more Using CPF for housing Protecting against losing your home",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Others",
        "text": "Forms Home ownership Find out more Using CPF for housing Protecting against losing your home Planning your housing journey PLAN with CPF FAQs Calculators Forms Healthcare financing Find out more Using MediSave MediShield Life Supplementary coverage ElderShield CareShield Life PLAN with CPF FAQs Calculators Forms Account services Find out more Your account information Providing for your loved ones Account closure Undergoing a divorce View account balances Update account settings CPF nomination Insuring to protect your dependants When you pass away When you leave Singapore Division of CPF assets PLAN with CPF FAQs Calculators Forms Your session is about to time out. You have been inactive for a while. Would you like to log out or continue? Log out Continue View page in mobile app We recommend viewing this page in the CPF Mobile app. Download the app? Download Continue with browser Home Infohub Educational resources What are the benefits of CPF LIFE? Educational resources What are the",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Plans",
        "text": "CPF LIFE has three different plans to choose from: the Escalating Plan, the Standard Plan, and the Basic Plan. The CPF LIFE Standard Plan provides level payouts. This plan is suitable for members who are comfortable with buying less and maintaining a modest lifestyle to cope with rising prices. Compared to the CPF LIFE Escalating Plan, the Standard Plan provides higher payouts at the start but it doesn't increase over time to keep up with the rising prices. Hence, the payouts will eventually be lower than Escalating Plan payouts. Under this plan, all your Retirement Account savings will be deducted as CPF LIFE premium when you join CPF LIFE. Your CPF LIFE monthly payouts will first be paid from your CPF LIFE premium. When your CPF LIFE premium is depleted, you will continue to receive the monthly payouts from the interest that you and other CPF LIFE members have accumulated, no matter how long you live.",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Plans",
        "text": "CPF LIFE has three different plans to choose from: the Escalating Plan, the Standard Plan, and the Basic Plan. CPF LIFE Basic Plan is a legacy plan carried over from the time CPF LIFE was first introduced in 2009. Many members would find the Standard or Escalating Plan more suited to their needs.If you opt for the Basic Plan, about 80-90% of your Retirement Account (RA) savings will be directly used to provide payouts until age 90. The remaining 10-20% will be deducted as your CPF LIFE premium when you join CPF LIFE and used to provide payouts from age 90 for the rest of your life. As less is used for your CPF LIFE premium, the monthly payout will be lower compared to the Standard Plan. The monthly payouts under Basic Plan will get progressively lower when your combined CPF balances eventually fall below $60,000. This is because the extra interest earned on the first $60,000 of your CPF balances is credited to your RA and factored into your monthly payouts. As your balances are withdrawn over time to provide you with monthly payouts, the amount of monthly payouts and extra interest will decrease when your balances fall below $60,000.",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Plans",
        "text": "PF LIFE has three different plans to choose from: the Escalating Plan, the Standard Plan, and the Basic Plan. The CPF LIFE Escalating Plan is a suitable option if you want to protect your retirement income from rising prices. Under this plan you will receive payouts that increase by 2% each year. Although the payouts start lower, they will eventually become higher than the Standard Plan and Basic Plan payouts. The Escalating Plan gives you peace of mind knowing that you can generally maintain your standard of living even as the cost of living goes up during your retirement years. For example, if you start with a monthly payout of $1,000 when you turn 65, it will increase by 2% each year and reach around $1,500 when you are 85. The 2% increase takes place every year in the same month that you receive your first payout. Under this plan, all your Retirement Account savings will be deducted as CPF LIFE premium when you join CPF LIFE, which can be anytime from 65 to 70. Your CPF LIFE monthly payouts will first be paid from your CPF LIFE premium. When your CPF LIFE premium is depleted, you will continue to receive the monthly payouts from the interest that you and other CPF LIFE members have accumulated, no matter how long you live.",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Benefits",
        "text": "savings in CPF and join CPF LIFE? Well, there are two considerations: A) Lump sum withdrawals vs steady returns over time When you reach 55 years of age, you can start making lump sum withdrawals from your CPF accounts, as long as you have put aside the Full Retirement Sum in your Retirement Account (RA). While having cash on hand may sound enticing, it means you’ll have less savings in your CPF accounts, and benefitting less from CPF’s steady interest rates. You are also likely to have lower CPF LIFE payouts in future. Thus, you should consider seriously before making such withdrawals. The next question to consider is why CPF LIFE instead of a private annuity plan. For starters, CPF LIFE can offer you payouts for life, in addition to being a safe product with risk-free returns. Even if a private annuity plan can provide payouts for life, it is not as secure as an annuity guaranteed by the Singapore government. Being non-profit and administered by the CPF Board, CPF LIFE also doesn’t",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Benefits",
        "text": "the Singapore government. Being non-profit and administered by the CPF Board, CPF LIFE also doesn’t incur any costs from advertising and agents’ commissions. Having the option to choose between three types of CPF LIFE plans also means you can choose how your payouts will grow and are paid out over time. This offers you the flexibility to adjust your payouts to suit your needs. B) Investments vs security Another consideration is withdrawing CPF savings to invest yourself, or to continue earning CPF’s steady interest rates. Investments may help grow your savings at a faster rate, but you run the risk of losing money. Before making investments, it’s good to ask yourself: how much are you willing to lose? Your risk appetite and overall financial situation are important, as it’s possible to lose everything you invest. If that happens, it can severely hamper your ability to live out your desired retirement lifestyle. On the other hand, what CPF LIFE offers isn’t the chance to multiply your",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Plans",
        "text": "retirement lifestyle. On the other hand, what CPF LIFE offers isn’t the chance to multiply your money quickly, but rather a secure and regular stream of payouts supported by steady interest rates. Leveraging CPF LIFE provides a sense of security. Your payouts can also increase over time (in the case of the Escalating Plan), providing you with more assurance that you can cope with inflation. Retirement is the final stretch of our life journey, and the last thing you need is uncertainty. With a steady stream of retirement income from CPF LIFE, you will be able to relax and enjoy the fruits of your labour, without having to worry about potential “thunderstorms” outside. The information provided in this article is accurate as of the date of publication. You might also be interested in... Retiring well Evading the sandwich generation pitfalls in 6 steps Learn how to effectively manage your retirement planning while juggling commitments to both your children and parents early in your",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Others",
        "text": "retirement planning while juggling commitments to both your children and parents early in your career. 27 Oct 2023 • 7 minute read Retiring well Give your retirement plan a boost with these 5 tips! Learn how to make the most of your CPF savings and choose the right CPF LIFE plan to achieve your retirement goals. 26 Oct 2023 CPF overview CPF answers: why can’t I withdraw all my CPF savings at age 55? Learn more about CPF withdrawal rules at age 55. 04 Mar 2024 • 10 minute read Retiring well Evading the sandwich generation pitfalls in 6 steps Learn how to effectively manage your retirement planning while juggling commitments to both your children and parents early in your career. 27 Oct 2023 • 7 minute read Retiring well Give your retirement plan a boost with these 5 tips! Learn how to make the most of your CPF savings and choose the right CPF LIFE plan to achieve your retirement goals. 26 Oct 2023 CPF overview CPF answers: why can’t I withdraw all my CPF savings at age 55? Learn more",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Others",
        "text": "26 Oct 2023 CPF overview CPF answers: why can’t I withdraw all my CPF savings at age 55? Learn more about CPF withdrawal rules at age 55. 04 Mar 2024 • 10 minute read View all Help us improve CPF Board Business partners Useful links Careers Contact us Feedback FAQ Report vulnerability Privacy statement Terms of use Sitemap Security best practices © 2024, Government of Singapore Last updated 24 Nov 2023",
        "source": "CPFB _ What are the benefits of CPF LIFE_.html"
    },
    {
        "category": "Others",
        "text": "$540 - $570 $97,300 $75,900 $60,000 $840 - $900 $159,600 $127,100 $102,900 $1,170 - $1,250 $227,900 $183,300 $150,000 $1,560 - $1,670 $308,900 $249,900 $205,800 $2,280 - $2,450 $458,300 $372,700 $308,700",
        "source": "CPF_LIFE_payouts.csv"
    },
    {
        "category": "Plans",
        "text": "What is CPF life CPF Lifelong Income For the Elderly (CPF LIFE) is a national longevity insurance annuity scheme that provides you with regular monthly payouts no matter how long you live, so you can enjoy your desired retirement lifestyle without worry. Here are some useful tidbits to help you better understand CPF LIFE. CPF life Escalating Plan The Escalating Plan has monthly payouts that start lower initially, but grow by 2% a year for life. This generally helps you maintain your desired retirement lifestyle even as the prices of items increase over the years. CPF life standard Plan The Standard Plan offers steady monthly payouts over the years. If keeping a fixed budget is your preferred approach, the Standard Plan suits your needs. However, this plan does not protect you against inflation, so you will have to buy less as things get more expensive in the years ahead. CPF life basic plan The Basic Plan offers monthly payouts that start low and fall progressively when your CPF",
        "source": "CPF_LIFE_summary.csv"
    },
    {
        "category": "Plans",
        "text": "plan The Basic Plan offers monthly payouts that start low and fall progressively when your CPF balances fall below $60,000. This means you will have to lower your lifestyle and buy even lesser in the future. Benefits of CPF Life CPF LIFE gives you peace of mind knowing that your retirement income will last no matter how long you live. You can start your CPF LIFE payouts anytime from age 65 to 70 years old, allowing your savings more time to accumulate more interest for when you finally need them. This ensures that you will have constant access to some form of income for your daily needs and passions even after you stop working, giving you peace of mind in retirement. CPF LIFE savings are also guaranteed by the Singapore Government, whereas private annuities are subject to investment market returns. In addition, as CPF LIFE is non-profit and administered by the CPF Board, it does not incur additional costs from advertising and agents’ commissions. Finally, having a large member base",
        "source": "CPF_LIFE_summary.csv"
    },
    {
        "category": "Benefits",
        "text": "additional costs from advertising and agents’ commissions. Finally, having a large member base also means longevity risks and costs can be better spread out. All these factors allow CPF LIFE to provide more value on your monthly payouts and you can be more assured of a peaceful retirement. Why does CPF Life matter A common question that is raised when talking about CPF LIFE is: Why should you care about monthly payouts? It comes down to risk management and knowing your own spending habits. As mentioned previously, CPF LIFE savings are guaranteed by the Singapore Government, which means its interest rates, with a floor of 4% and up to 2% extra interest per annum, come with no risk. For comparison, making a lump sum withdrawal and letting it sit there instead of growing it with compound interest means you end up with less savings in the long run. Similarly, making large amount of withdrawals only to spend it all without planning ahead will also hurt your retirement lifestyle in the long",
        "source": "CPF_LIFE_summary.csv"
    },
    {
        "category": "Benefits",
        "text": "only to spend it all without planning ahead will also hurt your retirement lifestyle in the long run. Similarly, using your savings for investments brings with it inherent risks, while CPF LIFE is a more reliable option that ensures your savings are not only safe, but can also grow at a steady pace. Interests earned on your CPF LIFE savings are factored into your payouts, enabling you to receive higher payouts right from the start. CPF Board does not keep any of the interest earned. Instead, it is pooled and used to form the monthly payouts of the remaining CPF LIFE members. Like other annuities, this risk-pooling feature ensures that all CPF LIFE members are assured of monthly payouts for as long as they live. This does not mean that your interest earned will be used to pay for other members’ payouts while you are alive! Like all annuity schemes, only the unpaid interest upon a member’s passing will go to the surviving members, with any unused premiums refunded to the deceased",
        "source": "CPF_LIFE_summary.csv"
    },
    {
        "category": "Others",
        "text": "passing will go to the surviving members, with any unused premiums refunded to the deceased member’s beneficiaries.",
        "source": "CPF_LIFE_summary.csv"
    }
]